# NoRelatedWarnings Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..NoRelatedWarnings Property
BuiltInFailures..::..GeneralFailures Class See Also
---
Document doesn't contain any warnings related to these elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoRelatedWarnings { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoRelatedWarnings As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoRelatedWarnings {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace